Revit 2027 API
WorksharingDisplaySettings.SetGraphicOverrides Method
Overload List
Name | Description
SetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings) |  Sets the graphic overrides assigned to elements with a particular ownership status.
SetGraphicOverrides(ModelUpdatesStatus, WorksharingDisplayGraphicSettings) |  Sets the graphic overrides assigned to elements with a particular status in the central model.
SetGraphicOverrides(String, WorksharingDisplayGraphicSettings) |  Sets the graphic overrides assigned to elements owned by a particular user. The username cannot be on the list of removed usernames.
SetGraphicOverrides(WorksetId, WorksharingDisplayGraphicSettings) |  Sets the graphic overrides assigned to elements in a particular user workset.
Top
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace